Autodesk.Revit.DB.BuiltInFailures.SteelElementsFailures.SteelElementModifiersWillBeIgnoredWarn
The copes and cuts (by face, with voids, by reference plane) of the element are no longer modifying the geometry.

Autodesk.Revit.DB.BuiltInFailures.SteelElementsFailures.SteelElementInvisibleInCurrentLevelOfDetailWarn
The created elements are only visible in Detail Level: Fine.

Autodesk.Revit.DB.BuiltInFailures.SteelElementsFailures
Failures about SteelElement module